test/fixtures/responses.json

{
  "error": "<?xml version='1.0' encoding='ISO-8859-1' ?><PayoneerResponse><Code>A00B556F</Code><Description>Unauthorized Access or invalid parameters, please check your IP address and parameters.</Description></PayoneerResponse>",
  "getToken": "<?xml version='1.0' encoding='UTF-8' ?> <PayoneerToken> <Token>https://payouts.sandbox.payoneer.com/partners/lp.aspx?token=171B5B82-295B-490C-A17F-60937A69989E</Token> </PayoneerToken>",
  "echo": "<?xml version='1.0' encoding='ISO-8859-1' ?><PayoneerResponse><Status>000</Status><Description>Echo Ok - All systems are up.</Description></PayoneerResponse>",
  "balance": "<?xml version='1.0' encoding='ISO-8859-1' ?><GetAccountDetails> <FeesDue>0.00</FeesDue> <AccountBalance>450.00</AccountBalance> <Curr>USD</Curr> </GetAccountDetails>",
  "getVersion": "<?xml version='1.0' encoding='ISO-8859-1' ?><PayoneerResponse><Version>4.0.0.0</Version></PayoneerResponse>",
  "payments": {
    "status": "<?xml version='1.0' encoding='ISO-8859-1' ?> <GetPaymentStatus> <PaymentId>42</PaymentId> <Result>000</Result> <Description>OK (Request accepted)</Description> <PaymentDate>11/11/2015 3:14:19 PM</PaymentDate> <Amount>42.00</Amount> <Status>Cancelled</Status> <LoadDate>1/1/1970 12:00:00 AM</LoadDate> <Curr>USD</Curr> </GetPaymentStatus>",
    "request": "<?xml version=\"1.0\" encoding=\"ISO-8859-1\" standalone=\"yes\"?><PerformPayoutPayment><Description>Success!</Description><PaymentID></PaymentID><Status>000</Status><PayoneerID>458501</PayoneerID></PerformPayoutPayment>",
    "unclaimed": "<?xml version='1.0' encoding='UTF-8' standalone='yes' ?> <GetUnclaimedPayments> <Payment> <IntPayeeId> 2</IntPayeeId><!--as assigned by partner --> <IntPaymentId>2 </IntPaymentId><!--as assigned by partner --> <PayoneerPaymentId> </PayoneerPaymentId><!--internal payoneer reference --> <Amount></Amount><!-- as calculated in payment --> <!--payee details as provided by payee: --> <FirstName> Hanna</FirstName> <LastName> </LastName> <Address1> </Address1> <Address2> </Address2> <City> </City> <State> </State> <Zip> </Zip> <Country><!--2 letter code --></Country> <Email> </Email> <Phone> </Phone> <Mobile> </Mobile> <PayOutMethod></PayOutMethod> <!--Prepaid Card/Direct deposit/iACH/PaperCheck/PayoneerAccount--> <PaymentDate> </PaymentDate> <Description> </Description><!--as provided in payment --> <Curr> </Curr> </Payment> <Payment> <IntPayeeId> </IntPayeeId><!--as assigned by partner --> <IntPaymentId> 1</IntPaymentId><!--as assigned by partner --> <PayoneerPaymentId>1 </PayoneerPaymentId><!--internal payoneer reference --> <Amount></Amount><!-- as calculated in payment --> <!--payee details as provided by payee: --> <FirstName>Huicho </FirstName> <LastName> </LastName> <Address1> </Address1> <Address2> </Address2> <City> </City> <State> </State> <Zip> </Zip> <Country><!--2 letter code --></Country> <Email> </Email> <Phone> </Phone> <Mobile> </Mobile> <PayOutMethod></PayOutMethod> <!--Prepaid Card/Direct deposit/iACH/PaperCheck/PayoneerAccount--> <PaymentDate> </PaymentDate> <Description> </Description><!--as provided in payment --> <Curr> </Curr> </Payment></GetUnclaimedPayments>",
    "cancel": "<?xml version='1.0' encoding='ISO-8859-1' standalone='yes'?> <CancelPayment> <PaymentID>42</PaymentID> <Result>000</Result> <Amount>42.00</Amount> <Curr>USD</Curr> <Description>Payment cancelled successfully</Description> </CancelPayment>"
  },
  "payees": {
    "getPayee": "<?xml version='1.0' encoding='ISO-8859-1' standalone='yes'?> <GetPayeeDetails> <Payee> <FirstName>Luis</FirstName> <LastName>Argumedo</LastName> <Email>huicho.argumedo@gmail.com</Email> <Address1>Mariano Jimenez 525</Address1> <Address2></Address2> <City>Guadalajara</City> <State></State> <Zip>44360</Zip> <Country>MX</Country> <Phone></Phone> <Mobile>523320095968</Mobile> <PayeeStatus>Active</PayeeStatus> <PayOutMethod>Prepaid Card</PayOutMethod> <Cards> <Card> <CardID>4366181846824935</CardID> <ActivationStatus>Card Issued, Not Activated</ActivationStatus> <CardShipDate>11/16/2015</CardShipDate> <CardStatus>Active</CardStatus> </Card> </Cards> <RegDate>11/10/2015 2:18:09 PM</RegDate> </Payee> <CompanyDetails> <CompanyName></CompanyName> </CompanyDetails> </GetPayeeDetails>",
    "updatePayeeId": "<?xml version='1.0' encoding='ISO-8859-1' ?> <ChangePayeeID> <OldPayee>42</OldPayee> <NewPayee>666</NewPayee> <Result>000</Result> <Description>Processed successfully</Description> </ChangePayeeID>",
    "getPayments": "<?xml version='1.0' encoding='ISO-8859-1' standalone='yes'?> <payoneerpayees> <Prepaid> <payee> <PayeeId>1</PayeeId> <Name>Luis Argumedo</Name> <Email>huicho.argumedo@gmail.com</Email> <RegistrationDate>11/10/2015 2:18:09 PM</RegistrationDate> <Status>Active</Status> <TotalAmount>84.00</TotalAmount> <Payments> <Payment> <Date>11/11/2015 3:14:19 PM</Date> <PaymentID>42</PaymentID> <PayoneerReferenceID>999925058</PayoneerReferenceID> <Amount>42.00</Amount> <Curr>USD</Curr> <Status>Cancelled</Status> <Description>Super payment</Description> </Payment> <Payment> <Date>11/13/2015 12:21:44 PM</Date> <PaymentID>42</PaymentID> <PayoneerReferenceID>999925553</PayoneerReferenceID> <Amount>42.00</Amount> <Curr>USD</Curr> <Status>Refund</Status> <Description>Payment 42 refunded</Description> </Payment> </Payments> </payee> </Prepaid> </payoneerpayees>",
    "report": "<?xml version='1.0' encoding='ISO-8859-1' standalone='yes'?> <PayoneerPayees> <iACH> <payee> <PayeeId>12345</PayeeId> <Name>Manuel de la Torre</Name> <Email>manuelmhtr@gmail.com</Email> <RegistrationDate>11/5/2015 3:10:58 PM</RegistrationDate> <Status>Active</Status> <TotalAmount>50.00</TotalAmount> <Payments> <Payment> <Date>11/13/2015 2:51:47 PM</Date> <PaymentID>666</PaymentID> <PayoneerReferenceID>999925554</PayoneerReferenceID> <Amount>25.00</Amount> <Curr>USD</Curr> <Status>Payment completed</Status> <Description>yolo</Description> </Payment> <Payment> <Date>11/13/2015 2:51:54 PM</Date> <PaymentID>123</PaymentID> <PayoneerReferenceID>999925555</PayoneerReferenceID> <Amount>25.00</Amount> <Curr>USD</Curr> <Status>Payment completed</Status> <Description>yolo</Description> </Payment> </Payments> </payee> </iACH> <Prepaid> <payee> <PayeeId>0</PayeeId> <Name>Luis Argumedo</Name> <Email>huichops@voxfeed.com</Email> <RegistrationDate>11/10/2015 2:23:25 PM</RegistrationDate> <Status>Active</Status> <TotalAmount>42.00</TotalAmount> <Payments> <Payment> <Date>11/18/2015 1:35:59 PM</Date> <PaymentID>454545</PaymentID> <PayoneerReferenceID>999928850</PayoneerReferenceID> <Amount>42.00</Amount> <Curr>USD</Curr> <Status>Pending Payee Approval</Status> <Description>yolo</Description> </Payment> </Payments> </payee> <payee> <PayeeId>1</PayeeId> <Name>Luis Argumedo</Name> <Email>huicho.argumedo@gmail.com</Email> <RegistrationDate>11/10/2015 2:18:09 PM</RegistrationDate> <Status>Active</Status> <TotalAmount>84.00</TotalAmount> <Payments> <Payment> <Date>11/11/2015 3:14:19 PM</Date> <PaymentID>42</PaymentID> <PayoneerReferenceID>999925058</PayoneerReferenceID> <Amount>42.00</Amount> <Curr>USD</Curr> <Status>Cancelled</Status> <Description>Super payment</Description> </Payment> <Payment> <Date>11/13/2015 12:21:44 PM</Date> <PaymentID>42</PaymentID> <PayoneerReferenceID>999925553</PayoneerReferenceID> <Amount>42.00</Amount> <Curr>USD</Curr> <Status>Refund</Status> <Description>Payment 42 refunded</Description> </Payment> </Payments> </payee> </Prepaid> </PayoneerPayees>"
  }

}
